Tekla.Structures.Solid.EdgeEnumerator
The EdgeEnumerator class is used to enumerate the edges of a solid.
using Tekla.Structures.Model;
using Tekla.Structures.Solid;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
ModelObjectEnumerator myEnum = new Model().GetModelObjectSelector().GetAllObjectsWithType(new Type[] { typeof(Part) });
while (myEnum.MoveNext())
{
try
{
Part part = myEnum.Current as Part;
if (part != null)
{
Console.WriteLine("Part id: " + part.Identifier.ID.ToString());
Solid solid = part.GetSolid();
if (solid != null)
{
EdgeEnumerator edgeEnumerator = solid.GetEdgeEnumerator();
int edgeCount = 0;
while (edgeEnumerator.MoveNext())
{
var edge = edgeEnumerator.Current as Edge;
if (edge != null)
{
Console.WriteLine("Start : " + edge.StartPoint.ToString());
Console.WriteLine("End : " + edge.EndPoint.ToString());
Console.WriteLine("Type : " + edge.Type.ToString());
edgeCount++;
}
}
Console.WriteLine("Edge count : " + edgeCount.ToString());
}
}
}
catch { }
}
}
}

Tekla.Structures.Solid.EdgeEnumerator.enumerator
The enumerator holding edges.

Tekla.Structures.Solid.EdgeEnumerator.#ctor(System.Collections.IEnumerator)
Initializes a new instance of the Tekla.Structures.Solid.EdgeEnumerator class. This constructor should
only be called by someone inheriting from ISolid.
enumerator: The father solid's global edge list enumerator.

Tekla.Structures.Solid.EdgeEnumerator.Current
Gets the current edge.

Tekla.Structures.Solid.EdgeEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Solid.EdgeEnumerator.Reset
Resets the enumerator to the beginning.